# Read/Write DataFrame from SQL with SQLAlchemy

In [2]:
import sqlalchemy as sa
import pandas as pd

## Create engine

### with MySQL Connector DBAPI:

for working with Oracle dialect check: https://docs.sqlalchemy.org/en/14/dialects/oracle.html

In [3]:
engine = sa.create_engine("mysql+mysqlconnector://test:test1234@localhost/SimpleCompanyDB")

## Get table names:

In [5]:
tables = sa.inspect(engine).get_table_names()
print("Tables in SimpleCompanyDB: ", tables)

Tables in SimpleCompanyDB:  ['company', 'company_employee', 'employee']

## Create DataFrame from SQL

Reaference: https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html

### Loaad DF from whole table

In [9]:
df = pd.read_sql('company', engine)
df

   company_id company_name
0           1       Google
1           2     Facebook
2           3    Microsoft

### Load DF from any SQL select statement

In [19]:
sql = '''
SELECT employee_name as emp_name, company_name as comp_name
FROM employee, company,company_employee
	WHERE employee.employee_id = company_employee.employee_id 
		AND company.company_id = company_employee.company_id
	ORDER BY emp_name;
'''
df = pd.read_sql(sql, engine)
df

        emp_name comp_name
0  Georgi Ivanov    Google
1  Georgi Ivanov  Facebook
2    Ivan Petrov  Facebook
3   Maria Popova    Google

In [32]:
df_employee = pd.read_sql('employee', engine)
df_company = pd.read_sql('company', engine)
df_compemp = pd.read_sql('company_employee',engine)

print(df_employee.columns)
print(df_company.columns)
print(df_compemp.columns)

Index(['employee_id', 'employee_name'], dtype='object')
Index(['company_id', 'company_name'], dtype='object')
Index(['employee_id', 'company_id'], dtype='object')

## Do some DF manipulations

In [43]:
df_new = df_compemp.merge(df_company).merge(df_employee).iloc[:, -2:]
df_new

  company_name  employee_name
0       Google   Maria Popova
1       Google  Georgi Ivanov
2     Facebook  Georgi Ivanov
3     Facebook    Ivan Petrov

## Write DataFrame to SQL table

In [29]:
df_new.to_sql(con=engine,name='new',if_exists='append')

3